# 1
geo_logs = [
    {'visit1': ['Москва', 'Россия']},
    {'visit2': ['Дели', 'Индия']},
    {'visit3': ['Владимир', 'Россия']},
    {'visit4': ['Лиссабон', 'Португалия']},
    {'visit5': ['Париж', 'Франция']},
    {'visit6': ['Лиссабон', 'Португалия']},
    {'visit7': ['Тула', 'Россия']},
    {'visit8': ['Тула', 'Россия']},
    {'visit9': ['Курск', 'Россия']},
    {'visit10': ['Архангельск', 'Россия']}
]

rus_filter_output = [
    {'visit1': ['Москва', 'Россия']},
    {'visit3': ['Владимир', 'Россия']},
    {'visit7': ['Тула', 'Россия']},
    {'visit8': ['Тула', 'Россия']},
    {'visit9': ['Курск', 'Россия']},
    {'visit10': ['Архангельск', 'Россия']}
]

india_filter_output = [{'visit2': ['Дели', 'Индия']}]

negative_output = 'Поиск по указанному вами фильтру не дал результатов'

geo_logs_broken = [
    {'visit1': ['Москва', 'Россия']},
    {'visit2': ['Дели', 'Индия', 1253]},
    {'visit3': ['Владимир', 'Россия', 'Россия']},
    {'visit4': ['Лиссабон', 'Португалия']},
    {'visit5': [['Париж', 'Франция'], [123, 153]]},
    {'visit6': [None, 'Португалия']},
    {'visit7': ['Тула', 'Россия']},
    {'visit8': ['Тула', 'Россия']},
    {'visit9': ['Курск', 'Россия']},
    {'visit10': ['Архангельск', 'Россия']},
    [],
    [[[1458, '125']], {}],
    None,
    12532145,
    'string'
]

geo_logs_dict = {
    'visit1': ['Москва', 'Россия'],
    'visit2': ['Дели', 'Индия'],
    'visit3': ['Владимир', 'Россия'],
    'visit4': ['Лиссабон', 'Португалия'],
    'visit5': ['Париж', 'Франция'],
    'visit6': ['Лиссабон', 'Португалия'],
    'visit7': ['Тула', 'Россия'],
    'visit8': ['Тула', 'Россия'],
    'visit9': ['Курск', 'Россия'],
    'visit10': ['Архангельск', 'Россия']
}

# 2
ids = {'user1': [213, 213, 213, 15, 213],
       'user2': [54, 54, 119, 119, 119],
       'user3': [213, 98, 98, 35]}

ids_correct_output = [98, 35, 15, 213, 54, 119]

ids_broken_output = [98, 15, 213, 54, 119, '', ',', 35]

ids_list = [
    [213, 213, 213, 15, 213],
    [54, 54, 119, 119, 119],
    [213, 98, 98, 35]
]

# 3
queries = [
    'смотреть сериалы онлайн',
    'новости спорта',
    'афиша кино',
    'курс доллара',
    'сериалы этим летом',
    'курс по питону',
    'сериалы про спорт',
]

queries_correct_output = [
    'Количество поисковых запросов из 3 слов - 57 %',
    'Количество поисковых запросов из 2 слов - 42 %'
]
